import React from "react";
export default class ChatList extends React.Component {
  render() {
    const { width, height, color } = this.props;
    return (
      <svg
        width={width}
        height={height}
        version="1.1"
        x="0px"
        y="0px"
        viewBox="0 0 21 21"
      >
        <g id="icon_Chatlist" transform="translate(-3769.5 -193.5)">
          <path
            id="减去_1"
            style={{ fill: color }}
            d="M3780,214c-5.5,0-10-4.5-10-10c0-5.5,4.5-10,10-10s10,4.5,10,10   c0,2.7-1.1,5.2-2.9,7.1l1.6,2.9h-8.3v0C3780.3,214,3780.1,214,3780,214z M3784.4,202.7c-0.7,0-1.3,0.6-1.3,1.3s0.6,1.3,1.3,1.3   c0.7,0,1.3-0.6,1.3-1.3C3785.6,203.3,3785.1,202.7,3784.4,202.7L3784.4,202.7z M3780,202.7c-0.7,0-1.3,0.6-1.3,1.3s0.6,1.3,1.3,1.3   c0.7,0,1.3-0.6,1.3-1.3C3781.3,203.3,3780.7,202.7,3780,202.7L3780,202.7z M3775.6,202.7c-0.7,0-1.3,0.6-1.3,1.3s0.6,1.3,1.3,1.3   s1.3-0.6,1.3-1.3C3777,203.3,3776.4,202.7,3775.6,202.7L3775.6,202.7z"
          />
        </g>
      </svg>
    );
  }
}
