import React from 'react';
export default class ArrowDown extends React.Component {

	render() {
		const { width, height } = this.props;
		return (
			<svg width={width} height={height} viewBox="0 0 140 140" version="1.1" >
				<g id="Icons" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
					<g transform="translate(-3077.000000, -91.000000)" fillRule="nonzero" id="icon_Empty_Products">
						<g transform="translate(3090.000000, 91.000000)">
							<path d="M4.77272727,0 L82.8640909,0.0429545455 L113.011818,30.2272727 L112.954545,135.227273 C112.954545,137.863177 110.817723,140 108.181818,140 L4.77272727,140 C2.13682278,140 3.22805199e-16,137.863177 0,135.227273 L0,4.77272727 C-3.22805199e-16,2.13682278 2.13682278,4.84207799e-16 4.77272727,0 Z" id="路径_55" fill="#E2E2E3"></path>
							<path d="M4.77272727,0 L82.8640909,0.0429545455 L82.8640909,24.9009091 C82.8640909,27.5959091 85.1438636,30.2209091 89.2277273,30.2209091 L113.011818,30.2209091 L112.954545,135.227273 C112.954545,137.863177 110.817723,140 108.181818,140 L4.77272727,140 C2.13682278,140 3.22805199e-16,137.863177 0,135.227273 L0,4.77272727 C-3.22805199e-16,2.13682278 2.13682278,4.84207799e-16 4.77272727,0 Z" id="路径_56" fill="#F7F7F7"></path>
							<rect id="矩形_17" fill="#E2E2E3" x="23.8636364" y="50.9090909" width="65.2272727" height="9.54545455" rx="3"></rect>
							<rect id="矩形_18" fill="#E2E2E3" x="23.8636364" y="76.3636364" width="65.2272727" height="9.54545455" rx="3"></rect>
							<rect id="矩形_19" fill="#E2E2E3" x="23.8636364" y="101.818182" width="65.2272727" height="9.54545455" rx="3"></rect>
						</g>
					</g>
				</g>
			</svg>
		)
	}

}